novaeco/Projet-Assistant--Reptiles/sdkconfig.defaults
# ESP32-S3 Specific
CONFIG_IDF_TARGET="esp32s3"

# Flash Size (16MB Required for dual ~4MB OTA slots + 8MB Storage)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# PSRAM (Required for RGB Panel & LVGL)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y

# LVGL Configuration (v9.4)
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_OS_FREERTOS=y

# Board calibration (battery ADC scaling)
CONFIG_BOARD_BATTERY_RAW_FULL=255
CONFIG_BOARD_BATTERY_RAW_EMPTY=0

# LCD RGB driver safety
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y

# Display
# Increase main task stack size for initialization
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=1024

# FATFS
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
